src/Tasks/ЗадачаИсполнителя/ЗадачаИсполнителя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗадачаИсполнителя</name>
  <addressing>InformationRegister.РолиИИсполнители</addressing>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>CatalogRef.ВидыЗадачПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЗадачи</name>
    <type>
      <types>DocumentRef.РегистрацияРазовыхУдержанийРаботниковОрганизаций</types>
      <types>DocumentRef.ОплатаПоСреднемуЗаработку</types>
      <types>DocumentRef.ОплатаСверхурочныхЧасов</types>
      <types>DocumentRef.НачислениеПоБольничномуЛисту</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>DocumentRef.Сторнирование</types>
      <types>DocumentRef.НевыходыВОрганизациях</types>
      <types>DocumentRef.НачислениеОтпускаРаботникамОрганизаций</types>
      <types>DocumentRef.ОплатаПраздничныхИВыходныхДнейОрганизаций</types>
      <types>DocumentRef.ПремииРаботниковОрганизаций</types>
      <types>DocumentRef.РегистрацияРазовыхНачисленийРаботниковОрганизаций</types>
      <types>DocumentRef.РасчетПриУвольненииРаботникаОрганизаций</types>
      <types>DocumentRef.РегистрацияПростоевВОрганизациях</types>
      <types>CatalogRef.Организации</types>
      <types>DocumentRef.КомандировкиОрганизаций</types>
      <types>CatalogRef.СотрудникиОрганизаций</types>
      <types>Number</types>
      <types>DocumentRef.НачислениеЕдиновременныхПособийЗаСчетФСС</types>
      <types>DocumentRef.НачислениеЗарплатыРаботникамОрганизаций</types>
      <types>DocumentRef.ОтпускПоУходуЗаРебенком</types>
      <types>DocumentRef.ОтсутствиеНаРаботеОрганизаций</types>
      <types>DocumentRef.ТабельУчетаРабочегоВремениОрганизации</types>
      <types>DocumentRef.ОтпускаОрганизаций</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

src/Tasks/ЗадачаИсполнителя/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// По описателям состояния задачи (реквизитам адресации) формирует текст инфо-строки и важность сообщения
//
// Параметры
//	Исполнитель, Роль, Организация, Выполнена - реквизиты, влияющие на состояние задачи
//
// Возвращаемое значение:
//	Структура из двух строковых значений - ТекстСообщения и ВажностьСообщения
//
Функция ПолучитьОписаниеОбъекта(Исполнитель, Роль, Организация, Выполнена) Экспорт
	
	Если Выполнена Тогда
		ТекстСообщения		= "Задача выполнена";
	Иначе
		Если ЗначениеЗаполнено(Исполнитель) Тогда
			ТекстСообщения		= "Задачу может выполнить только " + Исполнитель;
		Иначе
			ОписаниеРоли = "";
			Если ЗначениеЗаполнено(Роль) Тогда
				ОписаниеРоли = НРег(Строка(Роль));
			Иначе
				ОписаниеРоли = "кадровик или расчетчик";
			КонецЕсли;
			
			ОписаниеОрганизации = "";
			Если ЗначениеЗаполнено(Организация) Тогда
				ОписаниеОрганизации = " " + ОбщегоНазначения.ПреобразоватьСтрокуИнтерфейса("организации") + " " + Строка(Организация);
			КонецЕсли;
			
			ТекстСообщения		= "Задачу может выполнить любой " + ОписаниеРоли + ОписаниеОрганизации;
			
			РеквизитыАдресации = Новый Структура;
			Для Каждого Реквизит Из Метаданные().РеквизитыАдресации Цикл
				РеквизитыАдресации.Вставить(Реквизит.Имя, ЭтотОбъект[Реквизит.Имя]);
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	ВажностьСообщения	= "";
	
	Возврат Новый Структура("ТекстСообщения,ВажностьСообщения", ТекстСообщения, ВажностьСообщения)

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередВыполнением()
	
	// Исполнитель берется из параметра сеанса
	Если Исполнитель.Пустая() Тогда
		Исполнитель = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
